Тест 1 :
1. Какие из приведенных стилей программирования поддерживает язык Python?
 a) Процедурный
 b) Объектно-ориентированный
 c) Функциональный
 d) Смешанный
2. Каким способом можно объявлять переменные в Python:
 a) a=5
 b) a=int (5)
 c) int a=5
3. Какая функция отвечает за вывод на экран?
 а) cout<<a
 b) out (a)
 c) print (a)
4. Какая функция отвечает за открытие файла?
 a) file()
 b) open()
 c) open_file()
5. В каком из вариантов присутствует ошибка?
 a) a=5
 	print ('a')
 b) while True
 	print(a)
 c) a=open("file.txt")
6. Что делает команда import
 a) импортирует файл модуля
 b) создает функцию
 c) удаляет файл

7. Выберите вариант правильного удаления переменной а
 a) del(a)
 b) delete(a)
 c) delete=a
8. Какое значение 1//2 вернет выражение в среде IDLE?
 a) 0
 b) 0.5
 c) 0.50
9.Как называется встроенный в языке Python тип данных неупорядоченной коллекции из  нуля или более пар ключ-значение?
 a) dict
 b) set
 c) list
 d) frozenset
10.Если предположить, что класс Mydict наследует класс dict, то каким класс dict является по отношению к классу Mydict?
a) дочерним
b) подклассом
c) базовым
11. Отметьте фреймворки или библиотеки для полноценной разработки веб-приложений:
 a) PyTorch
 b) Flask
 c) TensorFlow
 d) Django
12. Напишите программу на языке Python, которая выведет на экран сумму всех четных чисел в диапазоне от 1 до 2021.













Ответы на тест
1) d 2) b,c  3) c 4) b  5) a  6) a 7) b 8) a  9) a  10) c 12) b,c

